first_routes/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new_title"], ["image_url", "new_url"], ["artist_id", 51], ["created_at", "2022-08-25 19:02:15.236475"], ["updated_at", "2022-08-25 19:02:15.236475"]]
---
  def create
    new_artwork = Artwork.new(artwork_params)
    if new_artwork.save

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 31]]
---
  def destroy
    artwork = Artwork.find(params[:id]) #security ?
    artwork.destroy

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def update
    artwork = Artwork.find(params[:id])