first_routes/app/controllers/artwork_shares_controller.rb

  def create
    new_artwork_share = ArtworkShare.new(share_params)

    if new_artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 28], ["viewer_id", 53], ["created_at", "2022-08-25 19:22:34.447770"], ["updated_at", "2022-08-25 19:22:34.447770"]]