first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "name", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-08-24 20:50:22.101031"], ["updated_at", "2022-08-24 20:50:22.101031"], ["name", "ronny2"], ["email", "ronny2@gmail.com"]]
---
  def create
    user = User.new(user_params) #works with .require(:user).permit on form data
    if user.save

SELECT "users".* FROM "users" WHERE (id = 30) LIMIT $1  [["LIMIT", 1]]
---
  def show
    user = User.find_by("id = #{params[:id]}")

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "name" = $2, "email" = $3 WHERE "users"."id" = $4  [["updated_at", "2022-08-25 13:28:47.438057"], ["name", "ronny_updated"], ["email", "ronny_email_updated"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
    user.update!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT "users".* FROM "users"
---
  def destroy
    user = User.find(params[:id])
    user.destroy
    render json: User.all